## Lesson 2

In [1]:
import numpy as np
import pandas as pd

In [2]:
path = r'Data\OnlineRetail.csv'
df = pd.read_csv(path)

In [3]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,539993,22386,JUMBO BAG PINK POLKADOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
1,539993,21499,BLUE POLKADOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
2,539993,21498,RED RETROSPOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
3,539993,22379,RECYCLING BAG RETROSPOT,5,2011-01-04 10:00:00,2.10,13313.0,United Kingdom
4,539993,20718,RED RETROSPOT SHOPPER BAG,10,2011-01-04 10:00:00,1.25,13313.0,United Kingdom

In [4]:
url = r"https://raw.githubusercontent.com/ntlong-NEU/DSEB65B-DataPre-Visual/refs/heads/main/Data/OnlineRetail.csv"
pd.read_csv(url)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,539993,22386,JUMBO BAG PINK POLKADOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
1,539993,21499,BLUE POLKADOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
2,539993,21498,RED RETROSPOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
3,539993,22379,RECYCLING BAG RETROSPOT,5,2011-01-04 10:00:00,2.10,13313.0,United Kingdom
4,539993,20718,RED RETROSPOT SHOPPER BAG,10,2011-01-04 10:00:00,1.25,13313.0,United Kingdom
...,...,...,...,...,...,...,...,...
203417,558637,22032,BOTANICAL LILY GREETING CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203418,558637,22028,PENNY FARTHING BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203419,558637,22033,BOTANICAL ROSE GREETING CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203420,558637,22029,SPACEBOY BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203421,558637,22024,RAINY LADIES BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom

In [5]:
df.head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,539993,22386,JUMBO BAG PINK POLKADOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
1,539993,21499,BLUE POLKADOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
2,539993,21498,RED RETROSPOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom
3,539993,22379,RECYCLING BAG RETROSPOT,5,2011-01-04 10:00:00,2.10,13313.0,United Kingdom
4,539993,20718,RED RETROSPOT SHOPPER BAG,10,2011-01-04 10:00:00,1.25,13313.0,United Kingdom
5,539993,85099B,JUMBO BAG RED RETROSPOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom
6,539993,20682,RED RETROSPOT CHILDRENS UMBRELLA,6,2011-01-04 10:00:00,3.25,13313.0,United Kingdom
7,539993,22961,JAM MAKING SET PRINTED,12,2011-01-04 10:00:00,1.45,13313.0,United Kingdom
8,539993,22667,RECIPE BOX RETROSPOT,6,2011-01-04 10:00:00,2.95,13313.0,United Kingdom
9,539993,22898,CHILDRENS APRON APPLES DESIGN,8,2011-01-04 10:00:00,1.95,13313.0,United Kingdom

In [6]:
df.tail(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
203420,558637,22029,SPACEBOY BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom
203421,558637,22024,RAINY LADIES BIRTHDAY CARD,12,2011-06-30 20:08:00,0.42,17891.0,United Kingdom

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 203422 entries, 0 to 203421
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    203422 non-null  object
 1   StockCode    203422 non-null  object
 2   Description  202623 non-null  object
 3   Quantity     203422 non-null  int64
 4   InvoiceDate  203422 non-null  object
 5   UnitPrice    203422 non-null  float64
 6   CustomerID   150039 non-null  float64
 7   Country      203422 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 12.4+ MB

In [8]:
type(df['InvoiceDate'][1])

str

In [9]:
# First, you may need to install the library:
#!pip install yfinance
import yfinance as yf

In [10]:
# Fetch Apple stock data ('AAPL') from Yahoo Finance
aapl = yf.download('AAPL', start='2023-01-01', end='2023-12-31')
aapl.head()

YF.download() has changed argument auto_adjust default to True

[*********************100%***********************]  1 of 1 completed

Price            Close        High         Low        Open     Volume
Ticker            AAPL        AAPL        AAPL        AAPL       AAPL
Date
2023-01-03  123.330635  129.079551  122.443150  128.468178  112117500
2023-01-04  124.602722  126.870739  123.340524  125.125350   89113600
2023-01-05  123.281334  125.993089  123.024955  125.361991   80962700
2023-01-06  127.817352  128.478033  123.153137  124.257564   87754700
2023-01-09  128.339981  131.554653  128.083602  128.655538   70790800

In [11]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  203422.000000  203422.000000  150039.000000
mean        9.585684       4.877820   15240.234832
std       240.921315     113.686676    1717.658493
min    -74215.000000       0.000000   12346.000000
25%         1.000000       1.250000   13791.000000
50%         3.000000       2.100000   15061.000000
75%        10.000000       4.130000   16771.000000
max     74215.000000   38970.000000   18287.000000

In [12]:
df[df['UnitPrice']==0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
17,539994,22830,NaN,-1,2011-01-04 10:09:00,0.0,NaN,United Kingdom
18,539995,85064,NaN,-12,2011-01-04 10:12:00,0.0,NaN,United Kingdom
19,539996,21784,NaN,-10,2011-01-04 10:12:00,0.0,NaN,United Kingdom
20,539997,84689,NaN,5,2011-01-04 10:15:00,0.0,NaN,United Kingdom
21,539998,84675,NaN,2,2011-01-04 10:16:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
200909,558457,21147,?,-95,2011-06-29 13:59:00,0.0,NaN,United Kingdom
201042,558464,35966,NaN,-20,2011-06-29 15:17:00,0.0,NaN,United Kingdom
201779,558476,84597B,damages,-6,2011-06-29 16:04:00,0.0,NaN,United Kingdom
201780,558477,84597C,NaN,-1,2011-06-29 16:04:00,0.0,NaN,United Kingdom
201917,558520,21896,NaN,-38,2011-06-30 10:25:00,0.0,NaN,United Kingdom

In [13]:
df[df["Quantity"]<0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
17,539994,22830,NaN,-1,2011-01-04 10:09:00,0.00,NaN,United Kingdom
18,539995,85064,NaN,-12,2011-01-04 10:12:00,0.00,NaN,United Kingdom
19,539996,21784,NaN,-10,2011-01-04 10:12:00,0.00,NaN,United Kingdom
22,539999,20892,NaN,-1,2011-01-04 10:16:00,0.00,NaN,United Kingdom
23,540000,84499,NaN,-9,2011-01-04 10:17:00,0.00,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
201945,C558531,22424,ENAMEL BREAD BIN CREAM,-1,2011-06-30 11:31:00,12.75,15039.0,United Kingdom
202318,C558553,23170,REGENCY TEA PLATE ROSES,-576,2011-06-30 12:44:00,1.45,17949.0,United Kingdom
202427,C558559,20749,ASSORTED COLOUR MINI CASES,-1,2011-06-30 13:20:00,7.95,17648.0,United Kingdom
202627,C558575,22693,GROW A FLYTRAP OR SUNFLOWER IN TIN,-24,2011-06-30 14:58:00,1.25,12674.0,France
203075,C558615,21845,DAIRY MAID STRIPE MUG,-4,2011-06-30 16:20:00,0.79,17719.0,United Kingdom

In [14]:
df_OR = pd.read_excel('Data\Online_Retail.xlsx')
df_OR.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [15]:
df_OR.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [18]:
type(df_OR['InvoiceNo'][1])

int

In [24]:
df_OR['InvoiceNo'] = df_OR['InvoiceNo'].astype(str)
df_OR.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [25]:
df_OR["InvoiceNo"][1]

'536365'

In [28]:
data = {'Name': ['John', 'Anna', 'Peter', 'Linda', 'James'],
        'Age': [28, 22, np.nan, 32, 25],
        'City': ['New York', 'Paris', 'Berlin', np.nan, 'London'],
        'Salary': [70000, np.nan, 60000, 85000, np.nan]}
df = pd.DataFrame(data)

In [29]:
df

    Name   Age      City   Salary
0   John  28.0  New York  70000.0
1   Anna  22.0     Paris      NaN
2  Peter   NaN    Berlin  60000.0
3  Linda  32.0       NaN  85000.0
4  James  25.0    London      NaN

In [34]:
df['Age'].fillna(df['Age'].mean(), inplace= True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_6712\1444409324.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace= True)

In [35]:
df

    Name    Age      City   Salary
0   John  28.00  New York  70000.0
1   Anna  22.00     Paris      NaN
2  Peter  26.75    Berlin  60000.0
3  Linda  32.00       NaN  85000.0
4  James  25.00    London      NaN

In [36]:
df['Salary'].fillna(method = 'bfill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_6712\1335963949.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Salary'].fillna(method = 'bfill')

0    70000.0
1    60000.0
2    60000.0
3    85000.0
4        NaN
Name: Salary, dtype: float64

In [37]:
df['Salary'].fillna(method = 'ffill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_6712\694346041.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Salary'].fillna(method = 'ffill')

0    70000.0
1    70000.0
2    60000.0
3    85000.0
4    85000.0
Name: Salary, dtype: float64

In [38]:
df_OR.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [39]:
df_OR.drop_duplicates(inplace = True)
df_OR.info()

<class 'pandas.core.frame.DataFrame'>
Index: 536641 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    536641 non-null  object
 1   StockCode    536641 non-null  object
 2   Description  535187 non-null  object
 3   Quantity     536641 non-null  int64
 4   InvoiceDate  536641 non-null  datetime64[ns]
 5   UnitPrice    536641 non-null  float64
 6   CustomerID   401604 non-null  float64
 7   Country      536641 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 36.8+ MB

In [40]:
df_OR.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135037
Country             0
dtype: int64

In [43]:
df_OR.dropna(subset=['CustomerID'], inplace=True)
df_OR.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [47]:
df_OR['CustomerID'] = df_OR['CustomerID'].astype(int).astype(str)
df_OR['InvoiceDate'] = pd.to_datetime(df_OR['InvoiceDate'])
df_OR.describe()

            Quantity                    InvoiceDate      UnitPrice
count  401604.000000                         401604  401604.000000
mean       12.183273  2011-07-10 12:08:23.848567552       3.474064
min    -80995.000000            2010-12-01 08:26:00       0.000000
25%         2.000000            2011-04-06 15:02:00       1.250000
50%         5.000000            2011-07-29 15:40:00       1.950000
75%        12.000000            2011-10-20 11:58:30       3.750000
max     80995.000000            2011-12-09 12:50:00   38970.000000
std       250.283037                            NaN      69.764035

In [46]:
df_OR.info()

<class 'pandas.core.frame.DataFrame'>
Index: 401604 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    401604 non-null  object
 1   StockCode    401604 non-null  object
 2   Description  401604 non-null  object
 3   Quantity     401604 non-null  int64
 4   InvoiceDate  401604 non-null  datetime64[ns]
 5   UnitPrice    401604 non-null  float64
 6   CustomerID   401604 non-null  object
 7   Country      401604 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 27.6+ MB

In [48]:
df_OR  = df_OR[df_OR['Quantity']>0]
df_OR.describe()

            Quantity                    InvoiceDate      UnitPrice
count  392732.000000                         392732  392732.000000
mean       13.153718  2011-07-10 19:15:24.576301568       3.125596
min         1.000000            2010-12-01 08:26:00       0.000000
25%         2.000000            2011-04-07 11:12:00       1.250000
50%         6.000000            2011-07-31 12:02:00       1.950000
75%        12.000000            2011-10-20 12:53:00       3.750000
max     80995.000000            2011-12-09 12:50:00    8142.750000
std       181.588420                            NaN      22.240725

In [49]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
df1

  letter  number
0      a       1
1      b       2

In [50]:
df2

  letter  number animal
0      c       3    cat
1      d       4    dog

In [ ]:
# axis = 0, jion = 'outer'
pd.concat([df1,df2])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [ ]:
# axis = 0, jion = 'inner'
pd.concat([df1,df2], join='inner', ignore_index= True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [56]:
# axis = 1, jion = 'outer'
pd.concat([df1,df2], axis=1, join='outer')

  letter  number letter  number animal
0      a       1      c       3    cat
1      b       2      d       4    dog

In [57]:
# axis = 1, jion = 'outer'
pd.concat([df1,df2], axis=1, join='inner')

  letter  number letter  number animal
0      a       1      c       3    cat
1      b       2      d       4    dog

In [58]:
pd.concat([df1,df2], axis=0, keys = ['df1','df2'])

      letter  number animal
df1 0      a       1    NaN
    1      b       2    NaN
df2 0      c       3    cat
    1      d       4    dog

In [ ]:
import seaborn as sns
tips = sns.load_dataset('tips').head
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [61]:
df = tips.head(10)

In [69]:
df[df['sex'] == 'Male']['total_bill'].sum()

np.float64(145.79)

In [73]:
df1 = pd.Series({'Sex':'Male',
                    'TotalBill':df[df['sex'] == 'Male']['total_bill'].sum()})
df1

Sex            Male
TotalBill    145.79
dtype: object

In [75]:
{'Sex':'Male','TotalBill':df[df['sex'] == 'Male']['total_bill'].sum()}

{'Sex': 'Male', 'TotalBill': np.float64(145.79)}

In [76]:
df_OR.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom

In [77]:
url1 = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv'
url2 = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv'
url3 = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv'

pop = pd.read_csv(url1)
areas = pd.read_csv(url2)
abbrevs = pd.read_csv(url3)

In [78]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [79]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [80]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [85]:
df1 = pd.merge(abbrevs, areas, how='outer')
df1.head()

        state abbreviation  area (sq. mi)
0     Alabama           AL          52423
1      Alaska           AK         656425
2     Arizona           AZ         114006
3    Arkansas           AR          53182
4  California           CA         163707

In [86]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [92]:
df2 = pd.merge(pop,df1,
         left_on="state/region", 
         right_on='abbreviation', 
         how='outer').drop(columns=['state/region','abbreviation'])

In [93]:
df2.head()

      ages    year  population   state  area (sq. mi)
0    total  1990.0    553290.0  Alaska       656425.0
1  under18  1990.0    177502.0  Alaska       656425.0
2    total  1992.0    588736.0  Alaska       656425.0
3  under18  1991.0    182180.0  Alaska       656425.0
4  under18  1992.0    184878.0  Alaska       656425.0

In [94]:
df2['ages'].unique()

array(['total', 'under18', nan], dtype=object)

In [101]:
df2.isnull().sum()

ages             0
year             0
population       0
state            0
area (sq. mi)    0
dtype: int64

In [ ]:
df2.drop_duplicates(inplace=True)
df2.drop

In [100]:
df2.dropna(inplace=True)

In [102]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2448 entries, 0 to 2543
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ages           2448 non-null   object
 1   year           2448 non-null   float64
 2   population     2448 non-null   float64
 3   state          2448 non-null   object
 4   area (sq. mi)  2448 non-null   float64
dtypes: float64(3), object(2)
memory usage: 114.8+ KB

In [ ]:
df3=df2[(df2['ages'] == 'total')& (df2['year'] == 2010)]

      ages    year  population       state  area (sq. mi)
43   total  2010.0    713868.0      Alaska       656425.0
51   total  2010.0   4785570.0     Alabama        52423.0
141  total  2010.0   2922280.0    Arkansas        53182.0
149  total  2010.0   6408790.0     Arizona       114006.0
197  total  2010.0  37333601.0  California       163707.0

In [109]:
df3['density'] = df3['population'] / df3['area (sq. mi)']
df3.head(5)

C:\Users\Admin\AppData\Local\Temp\ipykernel_6712\789052547.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['density'] = df3['population'] / df3['area (sq. mi)']

      ages    year  population       state  area (sq. mi)     density
43   total  2010.0    713868.0      Alaska       656425.0    1.087509
51   total  2010.0   4785570.0     Alabama        52423.0   91.287603
141  total  2010.0   2922280.0    Arkansas        53182.0   54.948667
149  total  2010.0   6408790.0     Arizona       114006.0   56.214497
197  total  2010.0  37333601.0  California       163707.0  228.051342

In [114]:
df3['Rank'] = df3['density'].rank(ascending=False)
df3.head()

C:\Users\Admin\AppData\Local\Temp\ipykernel_6712\3343658474.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Rank'] = df3['density'].rank(ascending=False)

      ages    year  population       state  area (sq. mi)     density  Rank
43   total  2010.0    713868.0      Alaska       656425.0    1.087509  51.0
51   total  2010.0   4785570.0     Alabama        52423.0   91.287603  26.0
141  total  2010.0   2922280.0    Arkansas        53182.0   54.948667  35.0
149  total  2010.0   6408790.0     Arizona       114006.0   56.214497  34.0
197  total  2010.0  37333601.0  California       163707.0  228.051342  12.0

In [116]:
df3[['state', 'density','Rank']].sort_values(by='Rank')

                     state      density  Rank
341   District of Columbia  8898.897059   1.0
1493            New Jersey  1009.253268   2.0
1962          Rhode Island   681.339159   3.0
293            Connecticut   645.600649   4.0
954          Massachusetts   621.815538   5.0
965               Maryland   466.445797   6.0
427               Delaware   460.445752   7.0
1637              New York   356.094135   8.0
475                Florida   286.597129   9.0
1829          Pennsylvania   275.966651  10.0
1722                  Ohio   257.549634  11.0
197             California   228.051342  12.0
714               Illinois   221.687472  13.0
2261              Virginia   187.622273  14.0
725                Indiana   178.197831  15.0
1338        North Carolina   177.617157  16.0
485                Georgia   163.409902  17.0
2069             Tennessee   150.825298  18.0
1973        South Carolina   144.854594  19.0
1482         New Hampshire   140.799273  20.0
570                 Hawaii   124.746707  21.0
858               Kentucky   107.586994  22.0
1061              Michigan   102.015794  23.0
2394            Washington    94.557817  24.0
2154                 Texas    93.987655  25.0
51                 Alabama    91.287603  26.0
869              Louisiana    87.676099  27.0
2442             Wisconsin    86.851900  28.0
1194              Missouri    86.015622  29.0
2453         West Virginia    76.519582  30.0
2346               Vermont    65.085075  31.0
1205           Mississippi    61.321530  32.0
1146             Minnesota    61.078373  33.0
149                Arizona    56.214497  34.0
141               Arkansas    54.948667  35.0
618                   Iowa    54.202751  36.0
1733              Oklahoma    53.778278  37.0
283               Colorado    48.493718  38.0
1818                Oregon    39.001565  39.0
1050                 Maine    37.509990  40.0
773                 Kansas    34.745266  41.0
2213                  Utah    32.677188  42.0
1589                Nevada    24.448796  43.0
1434              Nebraska    23.654153  44.0
629                  Idaho    18.794338  45.0
1578            New Mexico    16.982737  46.0
2058          South Dakota    10.583512  47.0
1349          North Dakota     9.537565  48.0
1253               Montana     6.736171  49.0
2501               Wyoming     5.768079  50.0
43                  Alaska     1.087509  51.0

In [ ]:
planets = sns.load_dataset('planets')
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

1. What is the total number of planets discovered?

2. What is the average orbital period of the discovered planets?

3. How many unique methods were used to discover the planets?

4. What is the maximum mass of the discovered planets?

5. What is the minimum distance of the discovered planets from Earth?

In [118]:
#1)
planets['number'].sum()

np.int64(1848)

In [119]:
#2)
planets['orbital_period'].mean()

np.float64(2002.9175960947582)

In [121]:
#3)
len(planets['method'].unique())

10

In [122]:
#4)
planets['mass'].max()

np.float64(25.0)

In [123]:
#5)
planets['distance'].min()

np.float64(1.35)

In [124]:
planets['number'].value_counts()

number
1    595
2    259
3     88
4     32
5     30
6     24
7      7
Name: count, dtype: int64

In [134]:
def groupbyhand(planets):
    mt_dict = {}
    for mt in planets['method'].unique():
        mt_dict[mt] = planets[planets['method'] == mt]['number'].sum()
    return pd.Series(mt_dict)

In [129]:
pd.Series(mt_dict)

Radial Velocity                  952
Imaging                           50
Eclipse Timing Variations         15
Transit                          776
Astrometry                         2
Transit Timing Variations          9
Orbital Brightness Modulation      5
Microlensing                      27
Pulsar Timing                     11
Pulsation Timing Variations        1
dtype: int64

In [ ]:
list(planets[['method','number']].groupby('method'))

[('Astrometry',
           method  number
  113  Astrometry       1
  537  Astrometry       1),
 ('Eclipse Timing Variations',
                         method  number
  32  Eclipse Timing Variations       1
  37  Eclipse Timing Variations       2
  38  Eclipse Timing Variations       2
  39  Eclipse Timing Variations       2
  40  Eclipse Timing Variations       2
  41  Eclipse Timing Variations       1
  42  Eclipse Timing Variations       1
  43  Eclipse Timing Variations       2
  44  Eclipse Timing Variations       2),
 ('Imaging',
         method  number
  29    Imaging       1
  30    Imaging       1
  31    Imaging       1
  33    Imaging       1
  34    Imaging       1
  35    Imaging       1
  36    Imaging       1
  47    Imaging       1
  54    Imaging       1
  68    Imaging       1
  69    Imaging       1
  70    Imaging       1
  71    Imaging       1
  72    Imaging       1
  73    Imaging       1
  74    Imaging       1
  75    Imaging       1
  89    Imaging       1
  90    Imaging       1
  124   Imaging       1
  150   Imaging       1
  392   Imaging       1
  423   Imaging       1
  577   Imaging       1
  635   Imaging       1
  639   Imaging       1
  643   Imaging       4
  644   Imaging       4
  645   Imaging       4
  646   Imaging       4
  900   Imaging       1
  937   Imaging       1
  948   Imaging       1
  949   Imaging       1
  950   Imaging       1
  957   Imaging       1
  1027  Imaging       1
  1029  Imaging       1),
 ('Microlensing',
             method  number
  902  Microlensing       1
  903  Microlensing       1
  904  Microlensing       1
  905  Microlensing       1
  906  Microlensing       1
  907  Microlensing       1
  908  Microlensing       1
  909  Microlensing       1
  910  Microlensing       1
  911  Microlensing       1
  912  Microlensing       1
  917  Microlensing       1
  918  Microlensing       1
  919  Microlensing       1
  920  Microlensing       1
  921  Microlensing       2
  922  Microlensing       2
  923  Microlensing       1
  924  Microlensing       1
  925  Microlensing       2
  926  Microlensing       2
  927  Microlensing       1
  928  Microlensing       1),
 ('Orbital Brightness Modulation',
                              method  number
  787  Orbital Brightness Modulation       2
  788  Orbital Brightness Modulation       2
  792  Orbital Brightness Modulation       1),
 ('Pulsar Timing',
              method  number
  941  Pulsar Timing       3
  942  Pulsar Timing       3
  943  Pulsar Timing       3
  944  Pulsar Timing       1
  945  Pulsar Timing       1),
 ('Pulsation Timing Variations',
                            method  number
  958  Pulsation Timing Variations       1),
 ('Radial Velocity',
                method  number
  0    Radial Velocity       1
  1    Radial Velocity       1
  2    Radial Velocity       1
  3    Radial Velocity       1
  4    Radial Velocity       1
  ..               ...     ...
  914  Radial Velocity       1
  915  Radial Velocity       1
  916  Radial Velocity       1
  939  Radial Velocity       1
  940  Radial Velocity       1

  [553 rows x 2 columns]),
 ('Transit',
         method  number
  91    Transit       1
  92    Transit       1
  93    Transit       1
  94    Transit       1
  95    Transit       1
  ...       ...     ...
  1030  Transit       1
  1031  Transit       1
  1032  Transit       1
  1033  Transit       1
  1034  Transit       1

  [397 rows x 2 columns]),
 ('Transit Timing Variations',
                          method  number
  680  Transit Timing Variations       2
  736  Transit Timing Variations       2
  749  Transit Timing Variations       3
  813  Transit Timing Variations       2)]

In [133]:
%timeit planets[['method','number']].groupby('method').sum()

1.74 ms ± 464 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [135]:
%timeit groupbyhand(planets)

5.05 ms ± 687 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)